<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="CSS.css" title="Color">
    <title>Historia de las Webs</title>
    
</head>
<body>
       <img src="https://virtual.pochutla.tecnm.mx/pluginfile.php/1/theme_moove/marketing2icon/1708016354/Logo-TecNM.png" width="130" height="110" align="left">
    &nbsp;
    &nbsp;
    <img src="https://upload.wikimedia.org/wikipedia/commons/a/ac/Logo-instituto-tecnologico-de-orizaba.png" width="130" height="110" align="right">
    <h1>Historia de las Webs</h1>
    &nbsp;
    &nbsp;
    <iframe width="560" height="315" src="https://www.youtube.com/embed/mFnRAPHrbN4?si=c6PBDEZyMia3DTvr" frameborder="0" allowfullscreen></iframe>
    &nbsp;
    &nbsp;
    
    <h3>Linea del Tiempo de la Evoluci&oacute;n de las Aplicaciones Web</h3>

<center>
    <table id="webs">
        <thead>
            <tr>
                <th>Versi&oacute;n</th>
                <th>Descripci&oacute;n</th>
                <th>Caracter&iacute;sticas Principales</th>
                <th>Im&aacute;genes</th>
            </tr>
        </thead>
        <tbody>
            <tr>
                <td><strong>Web 1.0</strong></td>
                <td>
                    <p>
                        La Web 1.0 se refiere a la primera fase de desarrollo de la World Wide Web, 
                        que abarc&oacute; desde la creaci&oacute;n de la web hasta principios de la d&eacute;cada de 2000.
                    </p>
                </td>
                <td>
                    <ul>
                        <li>
                            <p>
                               <strong> P&aacute;ginas Est&aacute;ticas</strong>: La mayor&iacute;a de los sitios web eran est&aacute;ticos, lo que significa que el 
                            contenido no cambiaba seg&uacute;n la interacci&oacute;n del usuario.</p>

                            <li><p><strong>Navegaci&oacute;n Unidireccional</strong>: La interactividad estaba limitada. Los usuarios pod&iacute;an consumir 
                                informaci&oacute;n, pero las opciones de participaci&oacute;n eran m&iacute;nimas.</p>
                            </li>
                            <li>
                                <p><strong>Ausencia de Redes Sociales</strong>: No exist&iacute;an plataformas de redes sociales en este per&iacute;odo.
                                La comunicaci&oacute;n en l&iacute;nea se basaba principalmente en correos electr&oacute;nicos y foros.</p>
                            </li>
                            <li>
                                <p><strong>Marcos Tecnol&oacute;gicos B&aacute;sicos</strong>: Los sitios web se constru&iacute;an utilizando tecnolog&iacute;as b&aacute;sicas 
                                como HTML <span style="color: red;"> (Hypertext Markup Language) </span> para la estructura y CSS <span style="color: red;"> (Cascading Style Sheets) </span> 
                                para el dise&ntilde;o visual.</p>
                            </li>
                        </li>
                    </ul>
                </td>
                <td> <img src="https://cdn.goconqr.com/uploads/media/image/16488448/desktop_54bef168-d887-4be2-8a2d-6174b9aede68.png" width="400" height="200"></td>
            </tr>
            <tr>
                <td><strong>Web 2.0</strong></td>
                <td>
                    <p id="p2">
                        La Web 2.0 representa la segunda generaci&oacute;n de la World Wide Web, y se
                        caracteriza por un cambio significativo en la forma en que las personas
                        interact&uacute;an en línea.
                        </p>
                    
                </td>
                <td>
                    <ul>
                        <li>
                            <p><strong>Interactividad Mejorada</strong>: Los usuarios pueden participar activamente, generar contenido y 
                            colaborar en l&iacute;nea. La web se vuelve m&aacute;s din&aacute;mica y receptiva a las acciones de los usuarios.</p>
                        </li>
                        <li>
                            <p><strong>Redes Sociales</strong>: Surgimiento y popularizaci&oacute;n de plataformas de redes sociales como 
                            Facebook, Twitter y LinkedIn, que permiten a los usuarios conectarse, compartir informaci&oacute;n
                            y participar en conversaciones en l&iacute;nea.</p>
                        </li>
                        <li>
                            <p><strong>Herramientas de Colaboraci&oacute;n</strong>: Aparici&oacute;n de herramientas colaborativas como wikis, que
                            permiten a m&uacute;ltiples usuarios editar y contribuir a documentos de manera simult&aacute;nea.</p>
                        </li>
                        <li>
                            <p><strong>Contenido Generado por Usuarios (UGC)</strong>: Mayor &eacute;nfasis en el contenido generado por los
                            propios usuarios, como blogs, comentarios, im&aacute;genes y videos compartidos en plataformas en 
                            l&iacute;nea.</p>
                        </li>
                        <li>
                            <p><strong>Tecnolog&iacute;as AJAX</strong>: Mayor uso de tecnolog&iacute;as como <span style="color: red;">Asynchronous JavaScript and XML </span>
                            (AJAX) para mejorar la velocidad y la interactividad de las aplicaciones web.</p>
                        </li>
                    </ul>
                </td>
                <td> <img src="https://ticsmichblog.files.wordpress.com/2015/12/web2-0.png?w=640" width="400" height="200"></td>
            </tr>
            <tr>
                <td><strong>Web 3.0</strong></td>
                <td>
                    <p>
                        La Web 3.0, tambi&eacute;n conocida como la "Web Semántica", representa la 
                        siguiente fase evolutiva de la World Wide Web. Aunque no hay una
                         definici&oacute;n &uacute;nica y precisa, la Web 3.0 se caracteriza por la
                        integraci&oacute;n de tecnolog&iacute;as y est&aacute;ndares que permiten una mayor
                         comprensi&oacute;n del contenido por parte de las m&aacute;quinas.</p>
                    </p>
                </td>
                <td>
                    <ul>
                        <li>
                            <p><strong>Semántica</strong>: En la Web 3.0, se busca que la informaci&oacute;n tenga significado y contexto. Se utiliza
                            la sem&aacute;ntica para comprender mejor el contenido y su relaci&oacute;n con otros datos.</p>
                        </li>
                        <li>
                            <p><strong>Inteligencia Artificial (IA)</strong>: La IA desempe&ntilde;a un papel crucial. Algoritmos avanzados y 
                            sistemas de aprendizaje autom&aacute;tico se utilizan para procesar datos, proporcionar 
                            recomendaciones personalizadas y mejorar la interacci&oacute;n usuario-m&aacute;quina.</p>
                        </li>
                        <li>
                            <p><strong>Interconexión de Datos</strong>: Se fomenta la interconexi&oacute;n de datos entre diferentes plataformas 
                                y fuentes. Los datos pueden ser enlazados y combinados de manera mas efectiva.</p>
                        </li>
                        <li>
                            <p><strong>Personalización</strong>: La Web 3.0 se esfuerza por ofrecer experiencias m&aacute;s personalizadas, 
                                adaptadas a las preferencias y necesidades individuales del usuario.</p>
                          
                        </li>
                        <li>
                            <p><strong>Mayor Interactividad</strong>: Se busca una mayor interactividad y participaci&oacute;n del usuario, 
                                a menudo a trav&eacute;s de interfaces m&aacute;s intuitivas y experiencias de usuario mejoradas. </p>
                        </li>
                    </ul>
                </td>
                <td> <img src="https://coindoo.com/wp-content/uploads/2022/09/cover-.png" width="400" height="200"></td>
            </tr>
            <tr>
                <td><strong>Web 4.0</strong></td>
                <td>
                    <p> La Web 4.0 es considerada la siguiente evoluci&oacute;n en la evoluci&oacute;n 
                    de la World Wide Web, y se espera que traiga caracter&iacute;sticas y
                    tecnolog&iacute;as m&aacute;s avanzadas en comparaci&oacute;n con las versiones anteriores.</p>
                </td>
                <td>
                    <ul>
                        <li>
                            <p><strong>Internet de las Cosas (IoT)</strong>: Mayor integraci&oacute;n de dispositivos y objetos f&iacute;sicos en la web, 
                            permitiendo la comunicaci&oacute;n y el intercambio de datos entre ellos.</p>
                        </li>
                        <li>
                            <p><strong>Inteligencia Artificial (IA)</strong>: Uso extensivo de IA para personalizaci&oacute;n avanzada, procesamiento 
                            de lenguaje natural, toma de decisiones aut&oacute;noma y adaptaci&oacute;n inteligente.</p>
                        </li>
                        <li>
                            <p><strong>Realidad Aumentada (AR)</strong>: Integraci&oacute;n m&aacute;s profunda de experiencias de realidad aumentada 
                            en la web, combinando el mundo virtual con el mundo real.</p>
                        </li>
                        <li>
                            <p><strong>Tecnologías Emergentes</strong>: Adopci&oacute;n de tecnolog&iacute;as emergentes como blockchain para la 
                            seguridad y trazabilidad, as&iacute; como otras tecnolog&iacute;as avanzadas que a&uacute;n est&aacute;n en desarrollo.</p>
                        </li>
                        <li>
                            <p><strong>Experiencias de Usuario Personalizadas</strong>: Ofrecer experiencias web altamente personalizadas 
                            y adaptativas basadas en el comportamiento del usuario y la inteligencia artificial.</p>
                        </li>
                        <li>
                            <p><strong>Avances en Velocidad y Eficiencia</strong>: Mejora significativa en la velocidad de carga de p&aacute;ginas 
                            web y eficiencia en la transferencia de datos.</p>
                        </li>
                    </ul>
                </td>
                <td> <img src="https://i0.wp.com/blog.aguilarsoluciones.com/wp-content/uploads/historia-web4_0-min.png?fit=500%2C300&ssl=1" width="400" height="200"></td>
            </tr>
        </tbody>
    </table>
</center>

    <hr>
     <address>
        Escrito por: Luis &Aacute;ngel Garc&iacute;a Marroqu&iacute;n</a>.<br>
        Instituto Tecnol&oacute;gico Nacional<br>
        Campus Orizaba<br>
        Ote. 9, Emiliano Zapata, 94320 <br>
        Orizaba, Veracruz, México.
      </address>

</body>
</html>
